#include<iostream>
#include<time.h>
#include<iomanip>
using namespace std;

// Функція для заповнення масиву випадковими числами в діапазоні від -20 до 50
int Mas(int arr[], int n)
{
    int min = -20;
    int max = 50;

    // Виведення елементів масиву
    cout << "[";
    for (int i = 0; i < n; i++)
    {
        // (max-min+1) визначає проміжок [min,max]  % визначає межі числа(остача може бути від 0 до знаменник-1)  min додається для корекції(rand=0 rand%range = 0 0-20 = -20; rand=остача-1 rand%range = 70 70-20 = 50
        arr[i] = min + rand() % (max-min+1);
        cout << arr[i];
        if (i < n - 1) {
            cout << ", ";
        }
    }
    cout << "]" << endl;
    return 0;
}

// Функція для обчислення та виведення суми додатних елементів (за виключенням тих, що знаходяться на позиціях кратних 5)
int Check(int arr[], int n) {
    int sum = 0;
    for (int i = 0; i < n; i++)
    {
        // Перевірка, чи є елемент додатнійй і не знаходиться на позиції, кратній 5
        if ((arr[i] > 0) && !(i % 5 == 0))
        {
            sum += arr[i];
        }
    }
    cout << "Sum = " << sum;
    return 0;
}
// Функція для заміни додатних елементів (за виключенням тих, що знаходяться на позиціях кратних 5) на 0
int Change_num(int arr[], int n)
{
    // Заміна додатних елементів на 0, якщо вони не знаходяться на позиціях кратних 5
    for (int i = 0; i < n; i++)
    {
        if ((arr[i] > 0) && (i % 5 != 0))
        {
            arr[i] = 0;
        }
    }

    // Виведення зміненого масиву
    cout << endl;
    cout << "[";
    for (int i = 0; i < n; i++)
    {
        cout << arr[i];
        if (i < n - 1) {
            cout << ", ";
        }
    }
    cout << "]" << endl;
    return 0;
}


int main() {
    srand((unsigned)time(NULL));
    const int SIZE = 20;
    int arr[SIZE];

    // Заповнення та виведення початкового масиву
    Mas(arr, SIZE);

    // Обчислення та виведення суми позитивних елементів (за виключенням тих, що знаходяться на позиціях кратних 5)
    Check(arr, SIZE);

    // Заміна позитивних елементів на 0 (за виключенням тих, що знаходяться на позиціях кратних 5) та виведення зміненого масиву
    Change_num(arr, SIZE);
    return 0;
}
